pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxCan_reg.h
/** \brief 620, Timestamp Counter Configuration 1 */
#define CAN1_N1_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0218620u)
/** Alias (User Manual Name) for CAN1_N1_TSCC.
* To use register names with standard convension, please use CAN1_N1_TSCC.
*/
#define CAN1_TSCC1 (CAN1_N1_TSCC)

/** \brief 624, Timestamp Counter Value 1 */
#define CAN1_N1_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0218624u)
/** Alias (User Manual Name) for CAN1_N1_TSCV.
* To use register names with standard convension, please use CAN1_N1_TSCV.
*/
#define CAN1_TSCV1 (CAN1_N1_TSCV)

/** \brief 628, Timeout Counter Configuration 1 */
#define CAN1_N1_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0218628u)
/** Alias (User Manual Name) for CAN1_N1_TOCC.
* To use register names with standard convension, please use CAN1_N1_TOCC.
*/
#define CAN1_TOCC1 (CAN1_N1_TOCC)

/** \brief 62C, Timeout Counter Value 1 */
#define CAN1_N1_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF021862Cu)
/** Alias (User Manual Name) for CAN1_N1_TOCV.
* To use register names with standard convension, please use CAN1_N1_TOCV.
*/
#define CAN1_TOCV1 (CAN1_N1_TOCV)

/** \brief 640, Error Counter Register 1 */
#define CAN1_N1_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0218640u)
/** Alias (User Manual Name) for CAN1_N1_ECR.
* To use register names with standard convension, please use CAN1_N1_ECR.
*/
#define CAN1_ECR1 (CAN1_N1_ECR)

/** \brief 644, Protocol Status Register 1 */
#define CAN1_N1_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0218644u)
/** Alias (User Manual Name) for CAN1_N1_PSR.
* To use register names with standard convension, please use CAN1_N1_PSR.
*/
#define CAN1_PSR1 (CAN1_N1_PSR)

/** \brief 648, Transmitter Delay Compensation Register 1 */
#define CAN1_N1_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0218648u)
/** Alias (User Manual Name) for CAN1_N1_TDCR.
* To use register names with standard convension, please use CAN1_N1_TDCR.
*/
#define CAN1_TDCR1 (CAN1_N1_TDCR)

/** \brief 650, Interrupt Register 1 */
#define CAN1_N1_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0218650u)
/** Alias (User Manual Name) for CAN1_N1_IR.
* To use register names with standard convension, please use CAN1_N1_IR.
*/
#define CAN1_IR1 (CAN1_N1_IR)

/** \brief 654, Interrupt Enable 1 */
#define CAN1_N1_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0218654u)
/** Alias (User Manual Name) for CAN1_N1_IE.
* To use register names with standard convension, please use CAN1_N1_IE.
*/
#define CAN1_IE1 (CAN1_N1_IE)

/** \brief 680, Global Filter Configuration 1 */
#define CAN1_N1_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0218680u)
/** Alias (User Manual Name) for CAN1_N1_GFC.
* To use register names with standard convension, please use CAN1_N1_GFC.
*/
#define CAN1_GFC1 (CAN1_N1_GFC)

/** \brief 684, Standard ID Filter Configuration 1 */
#define CAN1_N1_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0218684u)
/** Alias (User Manual Name) for CAN1_N1_SIDFC.
* To use register names with standard convension, please use CAN1_N1_SIDFC.
*/
#define CAN1_SIDFC1 (CAN1_N1_SIDFC)

/** \brief 688, Extended ID Filter Configuration 1 */
#define CAN1_N1_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0218688u)
/** Alias (User Manual Name) for CAN1_N1_XIDFC.
* To use register names with standard convension, please use CAN1_N1_XIDFC.
*/
#define CAN1_XIDFC1 (CAN1_N1_XIDFC)

/** \brief 690, Extended ID AND Mask 1 */
#define CAN1_N1_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0218690u)
/** Alias (User Manual Name) for CAN1_N1_XIDAM.
* To use register names with standard convension, please use CAN1_N1_XIDAM.
*/
#define CAN1_XIDAM1 (CAN1_N1_XIDAM)

/** \brief 694, High Priority Message Status 1 */
#define CAN1_N1_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0218694u)
/** Alias (User Manual Name) for CAN1_N1_HPMS.
* To use register names with standard convension, please use CAN1_N1_HPMS.
*/
#define CAN1_HPMS1 (CAN1_N1_HPMS)

/** \brief 698, New Data 1 1 */
#define CAN1_N1_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0218698u)
/** Alias (User Manual Name) for CAN1_N1_NDAT1.
* To use register names with standard convension, please use CAN1_N1_NDAT1.
*/
#define CAN1_NDAT11 (CAN1_N1_NDAT1)

/** \brief 69C, New Data 2 1 */
#define CAN1_N1_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF021869Cu)
/** Alias (User Manual Name) for CAN1_N1_NDAT2.
* To use register names with standard convension, please use CAN1_N1_NDAT2.
*/
#define CAN1_NDAT21 (CAN1_N1_NDAT2)

/** \brief 6A0, Rx FIFO 0 Configuration 1 */
#define CAN1_N1_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02186A0u)
/** Alias (User Manual Name) for CAN1_N1_RX_F0C.
* To use register names with standard convension, please use CAN1_N1_RX_F0C.
*/
#define CAN1_RXF0C1 (CAN1_N1_RX_F0C)

/** \brief 6A4, Rx FIFO 0 Status 1 */
#define CAN1_N1_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02186A4u)
/** Alias (User Manual Name) for CAN1_N1_RX_F0S.
* To use register names with standard convension, please use CAN1_N1_RX_F0S.
*/
#define CAN1_RXF0S1 (CAN1_N1_RX_F0S)

/** \brief 6A8, Rx FIFO 0 Acknowledge 1 */
#define CAN1_N1_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02186A8u)
/** Alias (User Manual Name) for CAN1_N1_RX_F0A.
* To use register names with standard convension, please use CAN1_N1_RX_F0A.
*/
#define CAN1_RXF0A1 (CAN1_N1_RX_F0A)

/** \brief 6AC, Rx Buffer Configuration 1 */
#define CAN1_N1_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02186ACu)
/** Alias (User Manual Name) for CAN1_N1_RX_BC.
* To use register names with standard convension, please use CAN1_N1_RX_BC.
*/
#define CAN1_RXBC1 (CAN1_N1_RX_BC)

/** \brief 6B0, Rx FIFO 1 Configuration 1 */
#define CAN1_N1_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02186B0u)
/** Alias (User Manual Name) for CAN1_N1_RX_F1C.
* To use register names with standard convension, please use CAN1_N1_RX_F1C.
*/
#define CAN1_RXF1C1 (CAN1_N1_RX_F1C)

/** \brief 6B4, Rx FIFO 1 Status 1 */
#define CAN1_N1_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02186B4u)
/** Alias (User Manual Name) for CAN1_N1_RX_F1S.
* To use register names with standard convension, please use CAN1_N1_RX_F1S.
*/
#define CAN1_RXF1S1 (CAN1_N1_RX_F1S)

/** \brief 6B8, Rx FIFO 1 Acknowledge 1 */
#define CAN1_N1_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02186B8u)
/** Alias (User Manual Name) for CAN1_N1_RX_F1A.
* To use register names with standard convension, please use CAN1_N1_RX_F1A.
*/
#define CAN1_RXF1A1 (CAN1_N1_RX_F1A)

/** \brief 6BC, Rx Buffer/FIFO Element Size Configuration 1 */
#define CAN1_N1_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02186BCu)
/** Alias (User Manual Name) for CAN1_N1_RX_ESC.
* To use register names with standard convension, please use CAN1_N1_RX_ESC.
*/
#define CAN1_RXESC1 (CAN1_N1_RX_ESC)

